Revit 2027 API
BuiltInFailures.ElectricalFailures.CannotAssignSecondaryDistSysToCircuit Property
 Cannot assign or add [Element] to Circuit. There is no assigned secondary distribution system for [Element].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAssignSecondaryDistSysToCircuit { get; }
Public Shared ReadOnly Property CannotAssignSecondaryDistSysToCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAssignSecondaryDistSysToCircuit {
	FailureDefinitionId^ get ();
}
static member CannotAssignSecondaryDistSysToCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace